app/views/user_mailer/event_registration.html.erb

SELECT COUNT(*) FROM "VEHICLES" INNER JOIN "EVENT_VEHICLES" ON "VEHICLES"."ID" = "EVENT_VEHICLES"."VEHICLE_ID" WHERE "EVENT_VEHICLES"."EVENT_ID" = 10026
---

<%if @event.vehicles.count > 0%>

SELECT COUNT(*) FROM "WEAPONS" INNER JOIN "EVENT_WEAPONS" ON "WEAPONS"."ID" = "EVENT_WEAPONS"."WEAPON_ID" WHERE "EVENT_WEAPONS"."EVENT_ID" = 10026
---

<%if @event.weapons.count > 0%>

SELECT COUNT(*) FROM "DRUGS" INNER JOIN "EVENT_DRUGS" ON "DRUGS"."ID" = "EVENT_DRUGS"."DRUG_ID" WHERE "EVENT_DRUGS"."EVENT_ID" = 10026
---

<%if @event.drug.count > 0%>