app/views/events/_people_fields.html.erb

          <%= f.label :status_id %><br />
          <%= f.collection_select(:status_id, Status.where(:status_type => "persona"), :id, :description, {:prompt => "seleccione el estatus de la persona"}) %>
---
SELECT "STATUSES".* FROM "STATUSES" WHERE "STATUSES"."STATUS_TYPE" = 'evento'