app/views/events/_weapons_fields.html.erb

        <%= f.label "Tipo" %><br />
        <%= f.collection_select(:weapon_type_id, WeaponType.all, :id, :desc, {:prompt => "seleccione tipo de arma"}) %>
---
SELECT "WEAPON_TYPES".* FROM "WEAPON_TYPES"