app/controllers/events_collections_controller.rb

SELECT "EVENTS".* FROM "EVENTS"
---
  def index
    @search = Event.search do