app/controllers/events_collections_controller.rb

SELECT "EVENTS_COLLECTIONS".* FROM "EVENTS_COLLECTIONS"
---
  def index
    @search = EventsCollection.search do

SELECT "EVENTS_COLLECTIONS".* FROM "EVENTS_COLLECTIONS" WHERE "EVENTS_COLLECTIONS"."ID" = :a1 AND ROWNUM <= 1  [["id", "10001"]]
---
  def show
    @events_collection = EventsCollection.find(params[:id])