app/controllers/events_controller.rb

SELECT "EVENTS".* FROM "EVENTS" WHERE ((analyst_id = 10000)) ORDER BY priority_id ASC
---
  def index
    #    @search = Event.ransack(params[:q])
    if current_user.role.super_admin==true || current_user.role.supervisor==true
      @events=Event.order('priority_id').all

SELECT "EVENTS".* FROM "EVENTS" WHERE "EVENTS"."ID" = :a1 AND ROWNUM <= 1  [["id", "10026"]]
---
  def show
    @event = Event.find(params[:id])

INSERT INTO "EVENTS" ("ANALYST_ID", "AREA_ID", "BACKUP_FILE", "CREATED_AT", "CRIME_ID", "DESCRIPTION", "DETAINED", "DRUG_ID", "DRUGS", "EVENT_DATE", "ID", "INTERIOR_NUMBER", "LOCALITY", "LOCALITY_ID", "OBSERVATIONS", "PERSON_ID", "PLACE_ID", "PRIORITY_ID", "SOURCE", "STATUS_ID", "STREET", "SUBURB", "SUSPECTS", "TOWNSHIP_ID", "UPDATED_AT", "VEHICLE_ID", "VEHICLES", "VICTIMS", "WEAPON_ID", "WEAPONS") VALUES (:a1, :a2, :a3, :a4, :a5, :a6, :a7, :a8, :a9, :a10, :a11, :a12, :a13, :a14, :a15, :a16, :a17, :a18, :a19, :a20, :a21, :a22, :a23, :a24, :a25, :a26, :a27, :a28, :a29, :a30)
---
  def create
    @event = Event.new(params[:event])
    @event.description = @event.description.upcase
    respond_to do |format|
      if @event.save